Revit 2026 API

# AnalyticalFixityState Enumeration

---

Specifies the fixity setting of individual degrees of freedom in analytical release conditions.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum AnalyticalFixityState
```
```vb
Public Enumeration AnalyticalFixityState
```
```cpp
public enum class AnalyticalFixityState
```
```fsharp
type AnalyticalFixityState
```

| Member name | Value | Description |
| --- | --- | --- |
| Fixed | 0 | Degree of freedom is Fixed. |
| Released | 1 | Degree of freedom is Released. |
| Spring | 2 | Degree of freedom has a Spring coefficient. |

#### Reference

Autodesk.Revit.DB.Structure Namespace